tsung/tsung_match_cache_test.xml
<?xml version="1.0" ?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [

]>
<tsung loglevel="notice">
     <!-- Client side setup -->
     <clients>
          <client host="localhost" use_controller_vm="true" maxusers="15000" />
     </clients>
     <!-- Server side setup -->
     <servers>
          <server host='app4t3microdbt3xlarge.2iscm2mqr5.us-west-2.elasticbeanstalk.com' port='80' type='tcp'></server>
     </servers>
     <load>
          <arrivalphase phase="1" duration="15" unit="minute" wait_all_sessions_end="true">
               <users arrivalrate="5" unit="second"></users>
          </arrivalphase>
	  <user session="match-polling" start_time="20" unit="second"></user>
     </load>
     <options>
          <!-- Set connection timeout to 2 seconds -->
          <option name="global_ack_timeout" value="2000"></option>
          <option type="ts_http" name="user_agent">
               <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
          </option>
     </options>

     <sessions>
	  <session name="match-polling" probability="100" type="ts_http">
	       <request>
                    <http url="/matches/1" version="1.1" method="GET"></http>
               </request>
          </session>
     </sessions>
</tsung>